from gtts import gTTS


stroy ="""
동화에서 그런 내용을 찾을 수 없었어요.
"""


tts = gTTS(stroy, lang='ko')
tts.save("./mp3/answer_exception2.mp3")

"""

옛날 어느 마을에 콩쥐라는 소녀가 살고 있었습니다.
콩쥐는 어머니를 일찍 여의고 편찮으신 아버지와 단둘이 살고 있었습니다.
어머니가 없었지만 콩쥐는 깊은 효심으로 아버지를 열심히 모셨습니다.
아버지: 콩쥐 네가 어미도 없이 고생이 많구나...
콩쥐: 아니에요 아버지... 저는 괜찮아요... 어서 방으로 들어가 진지 드세요.
아버지: 그러자꾸나.. 너도 어서 들어와 같이 먹거라.
콩쥐: 아버지 맋이 드세요. 그래야 저와 오래오래 사시죠..
그러던 어느 날, 콩쥐의 아버지는 어머니 없이 홀로 고생하는 콩쥐가 안타까워 배씨라는 과부를 들였습니다.
하지만 콩쥐의 새어머니에게는 팥쥐라는 딸이 있었습니다. 어쩔 수. 없이 콩쥐는 새어머니와 함께 팥쥐도 한집에서 살게 되었습니다.
착하고 마음 씨 좋은 콩쥐에 반해서 팥쥐는 욕심이 많고 자신밖에 모르는 심술쟁이였습니다. 새어머니는 콩쥐의 아버지가 없을 때 콩쥐에게 더욱더 힘든 일을 시키며 심술을 부렸습니다.
어머니: 아니, 콩쥐 너. 도대체 어디 있는 게냐?
콩쥐: 네 어머니, 부르셨어요? 뭐 시키실 일이라도 있으세요?
팥쥐: 시킬 일이 있으니까 불렀지! 널 왜 부르겠어?? 흥!
새어머니: 나는 지금 팥쥐와 시장으로 장을 보러 갈 것 이니, 너는 밭에 가서 밭을 매고 오너라.
콩쥐: 그 큰 밭의 저 혼자서요....?
새어머니: 왜?! 그것도 힘든다는 것인 게야? 잔소리 말고 끝내놓거라.
콩쥐: 네... 어머니.... 하루도 빠짐없이, 새어머니와 팥쥐는 콩쥐에게 가혹한 일을 시키면서 자기들은 시장에 가거나 마실을 다니는 등 콩쥐에게 나날이 힘든 일이 지속되었습니다.
하루는 새어머니가 콩쥐에게 또 다른 일을 시키고 있었습니다.
콩쥐: 어머니, 어디 가세요? 새어머니: 그래, 내 지금 팥쥐와 장에 좀 가봐야 할듯싶구나.
팥쥐: 어머니가 새로운 치마저고리를 사주신다고 해서 말이야. 후후후
콩쥐: 그러면 저도 따라가면 안 될까요? 저도 장에 나가본 지 오래되었어요, 어머니.
새어머니: 너는 옆집 김 씨네서 옷감을 가져다가 바느질을 해놓고 있거라. 듣고 있는 게냐?
콩쥐: 네... 어머니... 그렇게 할게요...
새어머니의 어떠한 말씀에도 콩쥐는 그저 따를 수밖에 없었습니다. 그러던 어느 날, 마을에 원님의 생일잔치가 열린다는 소문이 퍼져 갔습니다.
이 소식을 들은 계모와 팥쥐 모녀는 원님의 생일잔치에 갈 준비를 하고 있었습니다. 콩쥐 역시 그 소식을 듣고 새어머니에게 함께 가게 해달라고 부탁하려던 참 이였습니다.
콩쥐: 어머니, 오늘 원님의 생일잔치가 있다죠? 새어머니: 그건 네가 왜 묻는 게냐?
팥쥐: 맞아. 네가 알아도 넌 못 가는데? 하하 하하',
콩쥐: 어머니 저도 함께 갈 수 있게 해주세요.. 그동안 집 밖을 나가본 지가 너무 오래되었어요..
새어머니: 아니 너는 정신이 있는 게야 없는 게야?! 할 일이 산처럼 쌓여있는데!! 원님의 생일잔치에 가겠다고?!
콩쥐: 어머니.. 이번 한 번만 가게 해주세요..  그동안 집밖을 나가본지가 너무오래 되었어요..
새어머니: 아니 너는 정신이 있는 게야 없는 게야?! 할 일이 산처럼 쌓여있는데!! 원님의 생일잔치에 가겠다고?!
콩쥐: 어머니.. 이번 한 번만 가게 해주세요.. 새어머니: 좋다. 그렇다면 저기 저 옆에 있는 독에 물을 가득 채우고, 또 좁쌀도 먹기 좋게 다 골라놓고 오너라.
아 한 가지 더, 베도 짜놓고 그것을 다 한다면 내 허락을 하마.
콩쥐: 네 어머니... 빨리해놓고 저도 곧 갈게요.. 하지만 새어머니가 얘기한 일들은 쉽지 않았습니다. 독에 물을 열심히 부어도 독에 물은 차지 않고 시간은 곱절로 걸렸습니다. 그러자 갑자기 두꺼비가 나타났습니다. 두꺼비는 깨져있는 독을 자신의 몸으로 막아주었습니다. 그리하여 독에 물을 다 채울 수 있었습니다.
다음에는 참새가 나타나 좁쌀을 고르는 일을 도와주고 베를 짜는 일은 하늘에서 선녀가 나타나 도와주었습니다.
그리고 선녀는 콩쥐에게 예쁜 옷과 꽃신을 주고 돌아갔습니다. 선녀가 주고 간 그 예쁜 옷을 입고 꽃신도 신고 콩쥐는 원님의 생일잔치를 보러 걸어가고 있었습니다.
그런데 콩쥐가 시냇가를 걷고 있을 때 그만 꽃신 한 짝을 빠뜨리고 말았습니다.
콩쥐: 아.. 아니... 내 꽃신... 어쩌지...
그때 원님이 행차하다가 콩쥐가 시냇가에 빠뜨린 예쁜 꽃신을 보고 그의 하인에게 꽃 신의 주인을 찾아주라고 얘기했습니다.
하인은 마을의 집집마다 돌아다니며 그 꽃신의 주인을 찾기 시작했습니다. 며칠이 지나도록 그 신의 주인을 찾지 못하고 원님과 하인은 마지막으로 콩쥐의 집으로 찾아왔습니다.
하인: 계시오~~~ 잠깐 다들 나와보시오~~
새어머니: 아니, 무슨 일이오??? 하인:나는 원님과 함께 이 꽃신의 주인을 찾으러 왔소. 이 집에 이 꽃신을 신을만한 사람이 있소?
새어머니: 있지 그럼. 팥쥐야~~~ 팥쥐: 네 어머니. 부르셨어요? 새어머니: 원님께서 이 꽃신의 주인을 찾고 계신다고 하구나. 네가 한번 신어보거라.
팥쥐: 어머니.. 제 발에 너무 작아요..
원님: 허허... 도대체 이 신의 주인이 누구인고...
콩쥐: 내가 한 번 신어보겠소.. 그때, 콩쥐는 그 꽃신이 자신의 것임을 확신하고 용기를 내어, 자기가 꽃 신을 신어 보겠다고 말하기 시작했습니다.
콩쥐가 꽃신을 신자 신기하게도 콩쥐의 발에 꼭 맞았습니다. 콩쥐는 미소를 지으며 꽃신을 찾은 것을 기뻐했습니다. 팥쥐는 꽃신이 발에 맞지 않을 것을 아쉬워하며 울기 시작했고, 원님은 콩쥐의 아름다운 미모와 마음씨에 반하여 둘을 결혼을 하여 행복하게 오래오래 살았습니다.



"""